// уславието в switch-а винаги е стойност. Ако в if-а можем да използваме оператор за сравнение >=, <= и т.н, то във switch-а не може. 
// той работи по дируктно съвпадение. 
// case - играе ролата на if - във него се пише логиката, която следва да пъбе изпълнена, като накрая завършва с break (или не - зависи).
// default - играе ролята на else - ако не намериш съвпадение в нито едни от case-овете над него, то изпълни кода който е в default-а.


// още веднъж - тук се работи по директни съвпадения, докато уславната конструкция if else може да използва оператори за сравнение.




//първа задача от лекцията е много добър пример!