if (condition1) {
    console.log ("condition1 valid");
    if (condition2) {
        console.log ("condition2 valid");
    } else {
        console.log ("condition2 not valid");
    }
}

//след if-а и до края на else-а е вложената условна конструкция (втората условна конструкця - вложена в друга)
//вложените условни конструкции могат да бъдат много на брой - до безкрай, но в практиката максимума е 2

// всяка една вложена условна конструкция, за да бъде проверена и изпълнен кода в нея, е нужно външната за нея част, трябва да Е ВЪРНАЛА TRUE!


// 4-та задача от упражнението е добър пример