// && - логическо И - вярност И на двете условия
// || - логическо ИЛИ - вярност на едното ИЛИ на другото уславие
// !  - отрицание - ОТРИЦАНИЕ на уславие

//логическите оператори се използват за да комбинираме повече от едно уславие

 function solve (input){
     console.log(a < 10 && a !== 0);
// когато а е по-малко от 10 И в същото време а е различно от 0
// взима резултата и от двете страни И ако и двата резултата са true, то тогава целия израз приема стойност true 
// при логическото ИЛИ е достатъчно само една от двете страни да има стойност true, за да приеме целия израз стойност true
// при && е достатъчно само едната стойност да е false за да стане стойността на целия израз false
// при || е достатъчно една от двете страни да има стойност true, за да приеме целия израз стойност true
// ако обаче при || и двете стойности са false - резултата е false
}
solve(); 


function solve(input) {
    let isValid = true;
    console.log(!isValid);

// ! винаги връща обръща стойността на това, което вече сме получили
}
solve();

function solve(input) {
        console.log(false && true); //false
        console.log(true && false); //false
        console.log(false || true); //true 
        console.log(true || false); //true 
        console.log(false || true || false || false || false); //true
        console.log(false && true || false || false || false); //false  
}
solve();