
// Щом има логическо И, той проверява всики части (лявата и дясната) какви стойности имат и взима решение дали да даде true или false
// при оператор && ако eдна от страните на израза има стойност false целят израз приемата стойност false


// Проверява изпълнението на няколко условия едновременно
// Пример: проверка дали число е едновременно: 
// по-голямо от 5 и по-малко от 10
// четно
function solve(input) {
    let a = Number(input[0]);
    if (a > 5 && a < 10 && a % 2 == 0);
}
solve();
// това е за &&


// вложени праверки
if (a > 5) { 
    if (a < 10) {
      if (a % 2 == 0) {
  
      }
    }
  }

// логически оператор &&
if (a > 5 && a < 10 
    && a % 2 == 0) { 
  }
  