function solve(){
    for (let i = 1; i <= 12; i += 1) {    // i = i + 1  (крайната стойност на цикъла може да бъде изписана и по този начин)
        // искам да инициализирам една променлива със стойност 1
        // докато стойността на тази променлива е по-малка или равна на 12 - изпълнявай кода който е вътре и за всяка една итерация се съобрази с промяната или стъпката на цикъла (третата част)
        console.log(i);
      }
    // for цикъла започва с дефиниране на променлива, второто е кандишънал (условие) и третото е какво се случва на всяка една итерация
    //итерация - пълно завъртане на цикъла - едно изпълнении на кода между отварящия и затварящия брекет

}
solve();

//Циклите в програмирането ни позволяват да повтаряме едни и същи действия определен брой пъти



// function solve(){
//     for (;;) {   //валиден синтаксис - безкраен цикъл
        
//         console.log(1);
//     }

// }
// solve();