function solve(input) {
    for (let hours = 0; hours < 24; hours++) {
        console.log('hours --> ' + hours);
        for (let minutes = 0; minutes < 60; minutes++) {
            console.log('minutes --> ' + minutes);
        }
    }
    // когато влагаме един цикъл в друг цикъл, вътрешния цикъл извършва всичките си n-на брой итерации, които са зададени по условието му,
    // докато в същото време по-външния от него цикъл извършнва само една итерация
    // след това, цялото нещо се повтаря, докато не бъдат извършени всички итерации от условието на най-външния цикъл

    



}
solve()