function demo(input) { //ТОТО 3 от 10
    for (let x = 1; x <= 49; x++) {
        let isFinish = false;
        for (let y = 1; y <= 49; y++) {
            if (y === 15) {
                isFinish = true;
                break; // ограничава итерациите само на вътрешния цикъл - той е валиден САМО на него
            }

            console.log(`x ---> ${x}, y ---> ${y}`);
        }
        if (isFinish) { //по този начен се изнася горния бреак цикъл, използвайки булев флаг
            // цикъла, чрез проверката, пита: "финиширали ли сме, добре, значи и аз ще прекъсна"
            break;
        }
    }

}
demo()