function demo() {

    let array = [1, 2, 3, 4]

    array.unshift(10); 
    // unshift() e алтернативен метод на push() (единя добавя в началото, другия в края на масива)
   
    console.log(array.shift());
    // shift() е алтернативен на pop() - маха и връща парвия елемент
    console.log(array);
}
demo()


    // тези два метода не е препоръчетелно да се използват, тъй като по същество се създава нов масив и се пренареждат елементите му, което може да е проблем за масиви с много на брой елементи