function personalTitles(input) {
    let age = Number(input[0]);
    let sex = input[1];

    if (sex === "f") {
        if (age < 16) {               //FIXME: ако трябва да сложа и = трябва да наглася и изхода (горе ще са "големите", а долу "малките") + проверката по пол (трябва да е еднакъв), но и така работи на 100%
            console.log("Miss");
        } else {
            console.log("Ms.");
        }
    }
    if (sex === "m") {
        if (age < 16){                //FIXME: ако трябва да сложа и = трябва да наглася и изхода (горе ще са "големите", а долу "малките") + проверката по пол (трябва да е еднакъв), но и така работи на 100%
            console.log("Master");
        } else {
            console.log("Mr.");
        }
    }
}
personalTitles(["12", "f"]);
//personalTitles(["13.5", "m"]);
//personalTitles(["17", "m"]);
//personalTitles(["25", "f"]);






// •	"Mr." – мъж (пол 'm') на 16 или повече години
// •	"Master" – момче (пол 'm') под 16 години
// •	"Ms." – жена (пол 'f') на 16 или повече години
// •	"Miss" – момиче (пол 'f') под 16 години
