function solve() {
  let i = 0;
  while (i <= 5) {
    console.log("SoftUni");
    i++;
  }
  //променлива с първоначална стойност 0 - докато тази стойност е по-малка или равна ан 5 да се печата ""
  //оптечатва се 6 пъти - 5 + 0-левия индекс - така е заради = след < (ако беше без равно, щяха да са 5 пъти само)
}
solve();

function solve() {
  let i = 0;
  while (i == 0) {
    console.log("SoftUni");
    if (i == 1)
      break;
  }
// i е = 0; 
// докато i е равно на 0 (по стойност) ще се отпечатва ""
// да бреакне ако е равно на 1, но понеже нидъке няма инкремнтация ще изпадне в безкраен цикъл
}
solve();