function solve() {
    //console.log(!(5 == 5) && (4 + 1 == 5));
    // console.log(! (3 == 3) || (3 == 5));

    //console.log(!(3 > 5) || (1 == 1)); = TRUE - първо ще провери резултата от първата скоба, но ще го поправи с ! false + ! = true || true


    let number = 101;
    if (number >= 1)
        console.log("Larger than 1"); //въпреки че няма {} това е част усолвта конструкция, като само първия ред (този ред) е част от нея, но ако има втори (както долу той също ще се изпълни)
    if (number <= 101)
        console.log("Less than 101");
    console.log("Equal to 101"); //това не е част от условните конструкции, но въпреки това ще се изпълни

    // две НЕЗАВИСИМИ условни констрекции, които ще се изпълнят независимо от резултатаи на предходната




}
solve();
