// Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу. 
// Да се напише функция, която пресмята бонус точките, които получава числото и общия брой точки (числото + бонуса).
// // •	Ако числото е до 100 включително, бонус точките са 5.
// •	Ако числото е по-голямо от 100, бонус точките са 20% от числото.
// •	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.

// •	Допълнителни бонус точки (начисляват се отделно от предходните):
// o	За четно число  + 1 т.
// o	За число, което завършва на 5  + 2 т.

function bonusScore(input) {
    let num = Number(input[0]);
    let bonus = 0;


    if (num <= 100) {
        bonus = 5;
    } else if (num <= 1000) {
        bonus = 0.2 * num;
    } else {
        bonus = 0.1 * num;
    }
    if (num % 2 === 0) {
        bonus = bonus + 1;
        // bonus += 1;    може и така
    } else if (num % 10 === 5) {        // число делено на 10 винаги ни връща последната цифра!
        // bonus += 2;    може и така
        bonus = bonus + 2;
    }
    console.log(bonus);
    console.log(num + bonus);



}
bonusScore(["15875"]);