// Да се напише функция,  която получава като вида и размерите на геометрична фигура и пресмята лицето й. 
// Фигурите са четири вида: квадрат (square), правоъгълник (rectangle), кръг (circle) и триъгълник (triangle). 
// На първия ред на входа се чете вида на фигурата (текст със следните възможности: square, rectangle, circle или triangle). 
// •	Ако фигурата е квадрат (square): на следващия ред се чете едно дробно число - дължина на страната му
// •	Ако фигурата е правоъгълник (rectangle): на следващите два реда четат две дробни числа - дължините на страните му
// •	Ако фигурата е кръг (circle): на следващия ред чете едно дробно число - радиусът на кръга
// S = πr²
// •	Ако фигурата е триъгълник (triangle): на следващите два реда четат две дробни числа - дължината на страната му и дължината на височината към нея
// Резултатът да се закръгли до 3 цифри след десетичната запетая. 

// Рефакторинг на кода - означава изчистване и оптимизиране на кода

function areaOfFigures(input) {
    let a = input[0];
    let b = Number(input[1]);   // тук, и на долния ред, мога да махна двете променливи и да ги вложа долу при проверките (над result променливата)
    let c = Number(input[2]);   // валидно е да са тук, но е по-добре е да са долу, и с подходящи имена на променливите - трябва да имат СЕМАНТИЧНА стойност 
    let result = 0;

    if (a === "square") {
        result = b * b;
        // console.log(result.toFixed(3));  - не са ми нужни, след като съм дефинирал RESULT горе
    } else if (a === "rectangle") {
        result = b * c;
        // console.log(result.toFixed(3));
    } else if (a === "circle") {
        // result = Math.PI * (b * b);   // шибаната формула за лице на кръг, не знам дали не може да бъде записана и по друг начин?
        result = Math.PI * Math.pow(b,2); // може ай така! - Math.pow + стойността, която трябва да бъде повдигната и с колко (това в скобите)
        // console.log(result.toFixed(3));
    } else {
        result = (b * c) / 2;
        // console.log(result.toFixed(3));
    }
    console.log(result.toFixed(3));


}
areaOfFigures(["circle", "6"]);