// Инкрементиране - увеличаването на стойността на дадена променлива 
// Извършва се чрез оператори за инкрементиране: префиксни и постфиксни 
// Извършва се само върху променливи, които имат числена тойност 

// ++a пре-инкрементация (префиксна-инкрементация) - увеличава стойността с ЕДИНИЦА и връща а
// a++ пост-инкрементация (постфиксна-инкрементация) - връща а и увеличава стойността с ЕДИНИЦА
function solve(){
    let a = 0;
    console.log(++a); //резултата се записва в същата променлива и тогава се извършват действията с нея
    console.log('------');
    console.log(a);

}
solve();

function solve(){
    let a = 0;
    console.log(a++); //изръши всички действия с променливата, и когато приключиш увеличи стойността с една ЕДИНИЦА и я запази в същата променлива 
    console.log('------');
    console.log(a);

}
solve();