// Декрементиране – намаляването на стойността на дадена променлива 
// Извършва се чрез оператори за декрементиране:префиксни и постфиксни 
// Извършва се само върху променливи, които имат числена стойност 

// --a пре-декрементация (префиксна-декрементация) - намалява стойността с ЕДИНИЦА и връща а
// a-- пост-декрементация (пост-фиксна-декрементация) - връща а и намалява стойността с ЕДИНИЦА
function solve(){
    let a = 1;
    console.log(--a); //резултата се записва в същата променлива и тогава се извършват действията с нея
    console.log('------');
    console.log(a);

}
solve();

function solve(){
    let a = 1;
    console.log(a--); //изръши всички действия с променливата, и когато приключиш намали стойността с една ЕДИНИЦА и я запази в същата променлива 
    console.log('------');
    console.log(a);

}
solve();