function triangleOfNumbers(number) {

    let result = ''; //прави си билдър/буфер (празен спринг за да изгграждам всеки един от редовете, които са ми нужни)

    //използват се вложени цикли - единя цикъл ще се грижи за реда, а другия за колоната
    //първия вади броя на редовете
    //втория е ограничен ОТ броя на редовете, за да бъде триъгълна формата на резултата 
    //за да се повтори толкова (колкото е реда) на брой пъти дадено число
    //затова СТЪПКАТА му е ограничена до броя на ROWS

    for (let rows = 1; rows <= number; rows++) {
        for (let columns = 1; columns <= rows; columns++) {
            result += `${rows} `;
            //към променливата result (буфера) се добава един форматиран стринг, който е изграден от реда + празен спейс

        }
        console.log(result); //тук е конзолата, тъй като искаме резултата от първия цикъл, втория е вложен в него 
        result = '';         //тук се "занулява" изграждането на навия ред, за да няма натрупване на излишни стойности
    }


}
triangleOfNumbers(11)


