function arrayAdvanced() {

    let array = [1, 2, 3, 4];
    // let array2 = array; // грешен начин е да се копира масив като стойнстен тип
    let array2 = array.slice(0); // правилния начин за копиране на референтна стойнст
    // slice(0) създава изцяло нов масив, като ако се обработва единя масив, другия не се променя
    array.shift(); // метод променящ масив - реже отпред
    array.pop(); // метод променящ масив - реже отзад
    array.unshift(999); // метод променящ масив - добавя отпред
    array.push(44444); // метод променящ масив - добавя отзад

    console.log(array);
    console.log(array2);

}
arrayAdvanced()

// има два типа променливи в js - референтни и стойностни типове
// стойностни типове:
// let a = 5;
// a = 10;

// референтни типове: масиви и обикти

