function solve() {
    // let a = 5
    // let b = 6
    // console.log(a === b);
    // let result = a > b
    // let result = a >= b * 2
    // isValid вместо result
    // console.log(result);
    console.log(5 == 5);

}
solve();

//  = оператор за присваяване на стойност
//  == оператор за проверка на стойност (проверява само по стойност)
//  когато се използва оператор за проверка на стойност, резултатите са винаги true или false
//  === този оператор проверява по тип и по стойност - В ПРАКТИКАТА ВИНАГИ СЕ ПОЛЗВА ТОЙ!
//  hardCode(на) стойност или ЛИТЕРАЛ е стойност, която сами сме задали
//  != проверка за различно по стойност
//  !== проверка за различно по стойност и тип данни 
//  > по-голямо
//  >= поголямо или равно
//  < по-малко
//  <= по-малко или равно

// nMYnumber
// nMySecondNumber
// bResult 