// Math. - библиотека (математическа) от която мога да извиквам различни математически функции
// Math.ceil  - винаги закръгля чилтото към по-голямото
// Math.floor - винаги закръгля към по-малкото цяло число
// Math.trunc - изрязва десетичната част и взима само цялото число
// Math.pow   - повдига стойност на квадрат
// Math.round  - закръглава числа към най-близката цяла стойност

// .toFixed - форматира числото (обръща го към стринг), до задедна стойност (брой символи) след десетичната запетая
// резултата от .toFixed е винаги стринг - с него се получава КОНКАТЕНАЦИЯ
// възможно е понякога да си получават по-различни резултати, тъй като понякога се получава закръгляне към по-голамото число


function solve() {
    console.log(Math.floor(-5.1));
    // console.log(1.23456.toFixed(2));


}
solve();