function solve() {
    let a = 7;
    if (a > 4) {
        console.log("Bigger than 4");
    } else if (a > 5) {
        console.log("Bigger than 5");
    } else {
        console.log("Equal to 7");
    }

}
solve();


//  условната конструкция (проверка) винаги спира до първата, която даде (върне) верен резултат
// else if  - няма ограничение колко пъти може да бъде написан - колкото е нужно
// if - пише се веднъж в началото на условната конструкция и означава старт на условната конструкция
// else - означава край на условната конструкция
// в кода може да има още един (или няколко?) if, само че така се стартира нова условна конструкция, която е независима от предходната
// и всички условия, които се запишат в нея, ще бъдат проверени независима от резултата на проверката на предходната