function solve(input) {
    let currentDay = "Monday";
    let salary = 0;                     // така е валидно, защото променливата salary живее в тялото на функцията - в първите два брекета 
                                        // пише се да е = 0 дефолтна стойност, за да не пречи на последвали операции, когато ако трябва да се добави нещо към променливата, тъй като ако е недефинерана, като резулатат ще се върни Nan
    if (currentDay === "Monday") {
        // let salary = Number(input[0]);    // ако е тук живее само в бока на if-а и не може да бъде достъпена отвън, затова трябва да бъде инициализирана на по-горно ниво
        salary = Number(input[0]);
        //  инициализираната променлива живее само в пространството определено от {}, затова не ми излиза в конзолата
        // трябва да я инициализирам във функцията 
    }
    console.log(salary);

}
solve(["3000"]);


// scope - се нарича пространството между отварящ се и затварящ се брекет
// тяло на функцията или function scope

// {
//     {
//         {
//             {
//                 {
//                     {
//                         {
//                             {
//                                 {
//                                     {
//                                         let salary - валидна е от тук навътре ->
//                                         {
//                                             {
//                                                 {

//                                                 }
//                                             }
//                                         }
//                                     }
//                                 }
//                             }
//                         }
//                     }
//                 }
//             }
//         }
//     }
// }